Replace mermaid with plantuml with links in common interfaces description
